FILES/Documents/СвязьНоменклатур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>СвязьНоменклатур</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АктуальныйДокументСвязанныхНоменклатурБТ</xr:Item>
				<xr:Item>InformationRegister.СвязанныеНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтношениеУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеУчетаСвязанныхНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СвязанныеНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновнаяНоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураБТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПриемник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураБТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СвязаннаяНоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭлементОтбора</v8:Type>
								<v8:Type>cfg:CatalogRef.ЭлементСвязаннойНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрименяетсяК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииОписания</v8:Type>
								<v8:Type>cfg:CatalogRef.ЭлементОтбора</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаВПроцентах</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДСБТ</v8:Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СворачиватьНаУслугуВладельца</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитУстановкиЦены</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеМенееЧем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеБолееЧем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФункцииОписания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонСвязаннойУслуги</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеСвязаннойУслуги</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FILES/InformationRegisters/АктуальныйДокументСвязанныхНоменклатурБТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>АктуальныйДокументСвязанныхНоменклатурБТ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтношениеУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеУчетаСвязанныхНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/InformationRegisters/СвязанныеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СвязанныеНоменклатуры</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФиксированнаяСумма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДСБТ</v8:Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СворачиватьНаУслугуВладельца</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункцииОписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлементОтбора</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитУстановкиЦены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеМенееЧем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеБолееЧем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункцииОписания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонСвязаннойУслуги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатураБТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураБТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагенты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураБТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементОтбора</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлементСвязаннойНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтношениеУчетаСвязанныхНоменклатур</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеУчетаСвязанныхНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/Documents/СвязьНоменклатур/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	МодульОбъектаСервер.ПриЗаписи(ЭтотОбъект, Отказ, "Начало");
	//
	МодульОбъектаСервер.ПриЗаписи(ЭтотОбъект, Отказ, "Конец");
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	МодульОбъектаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, "Начало");
	//	
	Если НЕ МодульОбъектаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, "Вместо") Тогда
		// регистр УникальныеИдентификаторы
		УправлениеБТСервер.ЗаписатьGUID(Ссылка);

		
		// регистр АктуальныйДокументСвязанныхНоменклатурБТ
		Движения.АктуальныйДокументСвязанныхНоменклатурБТ.Записывать = Истина;
		Движение = Движения.АктуальныйДокументСвязанныхНоменклатурБТ.Добавить();
		Движение.Партнер = ЭтотОбъект.Партнер;
		Движение.Контрагент = ЭтотОбъект.Контрагент;
		Движение.Договор = ЭтотОбъект.Договор;
		Движение.ОтношениеУчета = ЭтотОбъект.ОтношениеУчета;
		Движение.Период = ЭтотОбъект.Дата;
		
		
		// регистр СвязанныеНоменклатуры
		Движения.СвязанныеНоменклатуры.Записывать = Истина;
		Для Каждого ТекСтрокаСвязанныеНоменклатуры Из СвязанныеНоменклатуры Цикл
			Движение = Движения.СвязанныеНоменклатуры.Добавить();
			
			Движение.Период = Дата;
			Движение.Партнер = Партнер;
			Движение.НоменклатураБТ = ТекСтрокаСвязанныеНоменклатуры.ОсновнаяНоменклатура;
			Движение.Контрагенты = Контрагент;
			Движение.Договор = Договор;
			Движение.УсловиеСвязи = ТекСтрокаСвязанныеНоменклатуры.СвязаннаяНоменклатура;
			
			Если ТипЗнч(ТекСтрокаСвязанныеНоменклатуры.СвязаннаяНоменклатура) = Тип("СправочникСсылка.ЭлементСвязаннойНоменклатуры") Тогда
				Движение.НоменклатураПриемник = ТекСтрокаСвязанныеНоменклатуры.СвязаннаяНоменклатура.НоменклатураБТ;
			Иначе
				Движение.НоменклатураПриемник = ТекСтрокаСвязанныеНоменклатуры.НоменклатураПриемник; //Справочники.НоменклатураБТ.ПустаяСсылка();
			КонецЕсли;
			Движение.ФиксированнаяСумма = НЕ ТекСтрокаСвязанныеНоменклатуры.ЦенаВПроцентах;
			Движение.Цена = ТекСтрокаСвязанныеНоменклатуры.Цена;
			Движение.СтавкаНДС = ТекСтрокаСвязанныеНоменклатуры.СтавкаНДС;
			Движение.СуммаНДС = ТекСтрокаСвязанныеНоменклатуры.СуммаНДС;
			Движение.Сумма = ТекСтрокаСвязанныеНоменклатуры.Сумма;
			Движение.ОтношениеУчетаСвязанныхНоменклатур = ОтношениеУчета;
			Движение.ПрименяетсяК = ?(ТекСтрокаСвязанныеНоменклатуры.ПрименяетсяК = Неопределено, Справочники.ЭлементОтбора.ПустаяСсылка(), ТекСтрокаСвязанныеНоменклатуры.ПрименяетсяК);
			Движение.РеквизитУстановкиЦены = ТекСтрокаСвязанныеНоменклатуры.РеквизитУстановкиЦены;
			
			Движение.СворачиватьНаУслугуВладельца = ТекСтрокаСвязанныеНоменклатуры.СворачиватьНаУслугуВладельца;
			
			Движение.НеМенееЧем = ТекСтрокаСвязанныеНоменклатуры.НеМенееЧем;
			Движение.НеБолееЧем = ТекСтрокаСвязанныеНоменклатуры.НеБолееЧем;
			Движение.Обработчик = ТекСтрокаСвязанныеНоменклатуры.Обработчик;
			
			Движение.ШаблонСвязаннойУслуги = ТекСтрокаСвязанныеНоменклатуры.ШаблонСвязаннойУслуги;
		КонецЦикла;
	КонецЕсли;	
	
	МодульОбъектаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения, "Конец");
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	МодульОбъектаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "Начало");
	//
	МодульОбъектаСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, "Конец");
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	МодульОбъектаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ, "Начало");
	//	
	Если НЕ МодульОбъектаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ, "Вместо") Тогда
		//
		УправлениеБТСервер.УдалитьGUID(Ссылка);
	КонецЕсли;
	
	МодульОбъектаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ, "Конец");
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	МодульОбъектаСервер.ПередУдалением(ЭтотОбъект, Отказ, "Начало");
	//	
	МодульОбъектаСервер.ПередУдалением(ЭтотОбъект, Отказ, "Конец");
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	МодульОбъектаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения, "Начало");
	//	
	МодульОбъектаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения, "Конец");
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	МодульОбъектаСервер.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс, "Начало");
	// Вставить содержимое обработчика.
	МодульОбъектаСервер.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс, "Конец");
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	МодульОбъектаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования, "Начало");
	// Вставить содержимое обработчика.
	МодульОбъектаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования, "Конец");
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МодульОбъектаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, "Начало");
	// Вставить содержимое обработчика.
	МодульОбъектаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, "Конец");
КонецПроцедуры
